Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_regdef.h
/** \\brief  Port Input Register */
typedef struct _Ifx_P_IN_Bits
{
    unsigned int P0 : 1;                      /**< \brief [0:0] Input Bit 0 (rh) */
    unsigned int P1 : 1;                      /**< \brief [1:1] Input Bit 1 (rh) */
    unsigned int P2 : 1;                      /**< \brief [2:2] Input Bit 2 (rh) */
    unsigned int P3 : 1;                      /**< \brief [3:3] Input Bit 3 (rh) */
    unsigned int P4 : 1;                      /**< \brief [4:4] Input Bit 4 (rh) */
    unsigned int P5 : 1;                      /**< \brief [5:5] Input Bit 5 (rh) */
    unsigned int P6 : 1;                      /**< \brief [6:6] Input Bit 6 (rh) */
    unsigned int P7 : 1;                      /**< \brief [7:7] Input Bit 7 (rh) */
    unsigned int P8 : 1;                      /**< \brief [8:8] Input Bit 8 (rh) */
    unsigned int P9 : 1;                      /**< \brief [9:9] Input Bit 9 (rh) */
    unsigned int P10 : 1;                     /**< \brief [10:10] Input Bit 10 (rh) */
    unsigned int P11 : 1;                     /**< \brief [11:11] Input Bit 11 (rh) */
    unsigned int P12 : 1;                     /**< \brief [12:12] Input Bit 12 (rh) */
    unsigned int P13 : 1;                     /**< \brief [13:13] Input Bit 13 (rh) */
    unsigned int P14 : 1;                     /**< \brief [14:14] Input Bit 14 (rh) */
    unsigned int P15 : 1;                     /**< \brief [15:15] Input Bit 15 (rh) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_P_IN_Bits;

/** \\brief  Port Input/Output Control Register 0 */
typedef struct _Ifx_P_IOCR0_Bits
{
    unsigned int reserved_0 : 3;              /**< \brief \internal Reserved */
    unsigned int PC0 : 5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8 : 3;              /**< \brief \internal Reserved */
    unsigned int PC1 : 5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16 : 3;             /**< \brief \internal Reserved */
    unsigned int PC2 : 5;                     /**< \brief [23:19]  (rw) */
    unsigned int reserved_24 : 3;             /**< \brief \internal Reserved */
    unsigned int PC3 : 5;                     /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR0_Bits;

/** \\brief  Port Input/Output Control Register 12 */
typedef struct _Ifx_P_IOCR12_Bits
{
    unsigned int reserved_0 : 3;              /**< \brief \internal Reserved */
    unsigned int PC12 : 5;                    /**< \brief [7:3]  (rw) */
    unsigned int reserved_8 : 3;              /**< \brief \internal Reserved */
    unsigned int PC13 : 5;                    /**< \brief [15:11]  (rw) */
    unsigned int reserved_16 : 3;             /**< \brief \internal Reserved */
    unsigned int PC14 : 5;                    /**< \brief [23:19]  (rw) */
    unsigned int reserved_24 : 3;             /**< \brief \internal Reserved */
    unsigned int PC15 : 5;                    /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR12_Bits;

/** \\brief  Port Input/Output Control Register 4 */
typedef struct _Ifx_P_IOCR4_Bits
{
    unsigned int reserved_0 : 3;              /**< \brief \internal Reserved */
    unsigned int PC4 : 5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8 : 3;              /**< \brief \internal Reserved */
    unsigned int PC5 : 5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16 : 3;             /**< \brief \internal Reserved */
    unsigned int PC6 : 5;                     /**< \brief [23:19]  (rw) */
    unsigned int reserved_24 : 3;             /**< \brief \internal Reserved */
    unsigned int PC7 : 5;                     /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR4_Bits;

/** \\brief  Port Input/Output Control Register 8 */
typedef struct _Ifx_P_IOCR8_Bits
{
    unsigned int reserved_0 : 3;              /**< \brief \internal Reserved */
    unsigned int PC8 : 5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8 : 3;              /**< \brief \internal Reserved */
    unsigned int PC9 : 5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16 : 3;             /**< \brief \internal Reserved */
    unsigned int PC10 : 5;                    /**< \brief [23:19]  (rw) */
    unsigned int reserved_24 : 3;             /**< \brief \internal Reserved */
    unsigned int PC11 : 5;                    /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR8_Bits;

/** \\brief  Port LVDS Pad Control Register 0 */
typedef struct _Ifx_P_LPCR0_Bits
{
    unsigned int REN_CTRL : 1;                /**< \brief [0:0] LVDS RX_EN controller (rw) */
    unsigned int RX_EN : 1;                   /**< \brief [1:1] Enable Receive LVDS (rw) */
    unsigned int TERM : 1;                    /**< \brief [2:2] Select Receiver Termination Mode (rw) */
    unsigned int LRXTERM : 3;                 /**< \brief [5:3] LVDS RX Poly-resistor configuration value (rw) */
    unsigned int LVDSM : 1;                   /**< \brief [6:6] LVDS-M Mode (rw) */
    unsigned int PS : 1;                      /**< \brief [7:7] Pad Supply Selection (rw) */
    unsigned int TEN_CTRL : 1;                /**< \brief [8:8] LVDS TX_EN controller (rw) */
    unsigned int TX_EN : 1;                   /**< \brief [9:9] Enable Transmit LVDS (rw) */
    unsigned int VDIFFADJ : 2;                /**< \brief [11:10] LVDS Output Amplitude Tuning (rw) */
    unsigned int VOSDYN : 1;                  /**< \brief [12:12] Tune Bit of VOS Control Loop Static/Dynamic (rw) */
    unsigned int VOSEXT : 1;                  /**< \brief [13:13] Tune Bit of VOS Control Loop Internal/External (rw) */
    unsigned int TX_PD : 1;                   /**< \brief [14:14] LVDS Power Down (rw) */
    unsigned int TX_PWDPD : 1;                /**< \brief [15:15] Enable TX Power down pull down. (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_P_LPCR0_Bits;

/** \\brief  Port LVDS Pad Control Register 1 */
typedef struct _Ifx_P_LPCR1_Bits
{
    unsigned int REN_CTRL : 1;                /**< \brief [0:0] LVDS RX_EN controller (rw) */
    unsigned int RX_EN : 1;                   /**< \brief [1:1] Enable Receive LVDS (rw) */
    unsigned int TERM : 1;                    /**< \brief [2:2] Select Receiver Termination Mode (rw) */
    unsigned int LRXTERM : 3;                 /**< \brief [5:3] LVDS RX Poly-resistor configuration value (rw) */
    unsigned int LVDSM : 1;                   /**< \brief [6:6] LVDS-M Mode (rw) */
    unsigned int PS : 1;                      /**< \brief [7:7] Pad Supply Selection (rw) */
    unsigned int TEN_CTRL : 1;                /**< \brief [8:8] LVDS TX_EN controller (rw) */
    unsigned int TX_EN : 1;                   /**< \brief [9:9] Enable Transmit LVDS (rw) */
    unsigned int VDIFFADJ : 2;                /**< \brief [11:10] LVDS Output Amplitude Tuning (rw) */
    unsigned int VOSDYN : 1;                  /**< \brief [12:12] Tune Bit of VOS Control Loop Static/Dynamic (rw) */
    unsigned int VOSEXT : 1;                  /**< \brief [13:13] Tune Bit of VOS Control Loop Internal/External (rw) */
    unsigned int TX_PD : 1;                   /**< \brief [14:14] LVDS Power Down (rw) */
    unsigned int TX_PWDPD : 1;                /**< \brief [15:15] Enable TX Power down pull down. (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_P_LPCR1_Bits;

/** \\brief  Port LVDS Pad Control Register 1 */
typedef struct _Ifx_P_LPCR1_P21_Bits
{
    unsigned int REN_CTRL : 1;                /**< \brief [0:0] LVDS RX_EN controller (rw) */
    unsigned int RX_EN : 1;                   /**< \brief [1:1] Enable Receive LVDS (rw) */
    unsigned int TERM : 1;                    /**< \brief [2:2] Select Receiver Termination Mode (rw) */
    unsigned int LRXTERM : 3;                 /**< \brief [5:3] LVDS RX Poly-resistor configuration value (rw) */
    unsigned int LVDSM : 1;                   /**< \brief [6:6] LVDS-M Mode (rw) */
    unsigned int PS : 1;                      /**< \brief [7:7] Pad Supply Selection (rw) */
    unsigned int reserved_8 : 24;             /**< \brief \internal Reserved */
} Ifx_P_LPCR1_P21_Bits;

/** \\brief  Port LVDS Pad Control Register 2 */
typedef struct _Ifx_P_LPCR2_Bits
{
    unsigned int REN_CTRL : 1;                /**< \brief [0:0] LVDS RX_EN controller (rw) */
    unsigned int RX_EN : 1;                   /**< \brief [1:1] Enable Receive LVDS (rw) */
    unsigned int TERM : 1;                    /**< \brief [2:2] Select Receiver Termination Mode (rw) */
    unsigned int LRXTERM : 3;                 /**< \brief [5:3] LVDS RX Poly-resistor configuration value (rw) */
    unsigned int LVDSM : 1;                   /**< \brief [6:6] LVDS-M Mode (rw) */
    unsigned int PS : 1;                      /**< \brief [7:7] Pad Supply Selection (rw) */
    unsigned int TEN_CTRL : 1;                /**< \brief [8:8] LVDS TX_EN controller (rw) */
    unsigned int TX_EN : 1;                   /**< \brief [9:9] Enable Transmit LVDS (rw) */
    unsigned int VDIFFADJ : 2;                /**< \brief [11:10] LVDS Output Amplitude Tuning (rw) */
    unsigned int VOSDYN : 1;                  /**< \brief [12:12] Tune Bit of VOS Control Loop Static/Dynamic (rw) */
    unsigned int VOSEXT : 1;                  /**< \brief [13:13] Tune Bit of VOS Control Loop Internal/External (rw) */
    unsigned int TX_PD : 1;                   /**< \brief [14:14] LVDS Power Down (rw) */
    unsigned int TX_PWDPD : 1;                /**< \brief [15:15] Enable TX Power down pull down. (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_P_LPCR2_Bits;

