Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_regdef.h
/** \\brief  Port LVDS Pad Control Register 3 */
typedef struct _Ifx_P_LPCR3_Bits
{
    unsigned int REN_CTRL : 1;                /**< \brief [0:0] LVDS RX_EN controller (rw) */
    unsigned int RX_EN : 1;                   /**< \brief [1:1] Enable Receive LVDS (rw) */
    unsigned int TERM : 1;                    /**< \brief [2:2] Select Receiver Termination Mode (rw) */
    unsigned int LRXTERM : 3;                 /**< \brief [5:3] LVDS RX Poly-resistor configuration value (rw) */
    unsigned int LVDSM : 1;                   /**< \brief [6:6] LVDS-M Mode (rw) */
    unsigned int PS : 1;                      /**< \brief [7:7] Pad Supply Selection (rw) */
    unsigned int TEN_CTRL : 1;                /**< \brief [8:8] LVDS TX_EN controller (rw) */
    unsigned int TX_EN : 1;                   /**< \brief [9:9] Enable Transmit LVDS (rw) */
    unsigned int VDIFFADJ : 2;                /**< \brief [11:10] LVDS Output Amplitude Tuning (rw) */
    unsigned int VOSDYN : 1;                  /**< \brief [12:12] Tune Bit of VOS Control Loop Static/Dynamic (rw) */
    unsigned int VOSEXT : 1;                  /**< \brief [13:13] Tune Bit of VOS Control Loop Internal/External (rw) */
    unsigned int TX_PD : 1;                   /**< \brief [14:14] LVDS Power Down (rw) */
    unsigned int TX_PWDPD : 1;                /**< \brief [15:15] Enable TX Power down pull down. (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_P_LPCR3_Bits;

/** \\brief  Port LVDS Pad Control Register 5 */
typedef struct _Ifx_P_LPCR5_Bits
{
    unsigned int REN_CTRL : 1;                /**< \brief [0:0] LVDS RX_EN controller (rw) */
    unsigned int RX_EN : 1;                   /**< \brief [1:1] Enable Receive LVDS (rw) */
    unsigned int TERM : 1;                    /**< \brief [2:2] Select Receiver Termination Mode (rw) */
    unsigned int LRXTERM : 3;                 /**< \brief [5:3] LVDS RX Poly-resistor configuration value (rw) */
    unsigned int LVDSM : 1;                   /**< \brief [6:6] LVDS-M Mode (rw) */
    unsigned int PS : 1;                      /**< \brief [7:7] Pad Supply Selection (rw) */
    unsigned int TEN_CTRL : 1;                /**< \brief [8:8] LVDS TX_EN controller (rw) */
    unsigned int TX_EN : 1;                   /**< \brief [9:9] Enable Transmit LVDS (rw) */
    unsigned int VDIFFADJ : 2;                /**< \brief [11:10] LVDS Output Amplitude Tuning (rw) */
    unsigned int VOSDYN : 1;                  /**< \brief [12:12] Tune Bit of VOS Control Loop Static/Dynamic (rw) */
    unsigned int VOSEXT : 1;                  /**< \brief [13:13] Tune Bit of VOS Control Loop Internal/External (rw) */
    unsigned int TX_PD : 1;                   /**< \brief [14:14] LVDS Power Down (rw) */
    unsigned int TX_PWDPD : 1;                /**< \brief [15:15] Enable TX Power down pull down. (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_P_LPCR5_Bits;

/** \\brief  Port LVDS Pad Control Register 6 */
typedef struct _Ifx_P_LPCR6_Bits
{
    unsigned int reserved_0 : 7;              /**< \brief \internal Reserved */
    unsigned int PS : 1;                      /**< \brief [7:7] Pad Supply Selection (rw) */
    unsigned int TEN_CTRL : 1;                /**< \brief [8:8] LVDS TX_EN controller (rw) */
    unsigned int TX_EN : 1;                   /**< \brief [9:9] Enable Transmit LVDS (rw) */
    unsigned int VDIFFADJ : 2;                /**< \brief [11:10] LVDS Output Amplitude Tuning (rw) */
    unsigned int VOSDYN : 1;                  /**< \brief [12:12] Tune Bit of VOS Control Loop Static/Dynamic (rw) */
    unsigned int VOSEXT : 1;                  /**< \brief [13:13] Tune Bit of VOS Control Loop Internal/External (rw) */
    unsigned int TX_PD : 1;                   /**< \brief [14:14] LVDS Power Down (rw) */
    unsigned int TX_PWDPD : 1;                /**< \brief [15:15] Enable TX Power down pull down. (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_P_LPCR6_Bits;

/** \\brief  Port Output Modification Clear Register 0 */
typedef struct _Ifx_P_OMCR0_Bits
{
    unsigned int reserved_0 : 16;             /**< \brief \internal Reserved */
    unsigned int PCL0 : 1;                    /**< \brief [16:16] Clear Bit 0 (w) */
    unsigned int PCL1 : 1;                    /**< \brief [17:17] Clear Bit 1 (w) */
    unsigned int PCL2 : 1;                    /**< \brief [18:18] Clear Bit 2 (w) */
    unsigned int PCL3 : 1;                    /**< \brief [19:19] Clear Bit 3 (w) */
    unsigned int reserved_20 : 12;            /**< \brief \internal Reserved */
} Ifx_P_OMCR0_Bits;

/** \\brief  Port Output Modification Clear Register 12 */
typedef struct _Ifx_P_OMCR12_Bits
{
    unsigned int reserved_0 : 28;             /**< \brief \internal Reserved */
    unsigned int PCL12 : 1;                   /**< \brief [28:28] Clear Bit 12 (w) */
    unsigned int PCL13 : 1;                   /**< \brief [29:29] Clear Bit 13 (w) */
    unsigned int PCL14 : 1;                   /**< \brief [30:30] Clear Bit 14 (w) */
    unsigned int PCL15 : 1;                   /**< \brief [31:31] Clear Bit 15 (w) */
} Ifx_P_OMCR12_Bits;

/** \\brief  Port Output Modification Clear Register 4 */
typedef struct _Ifx_P_OMCR4_Bits
{
    unsigned int reserved_0 : 20;             /**< \brief \internal Reserved */
    unsigned int PCL4 : 1;                    /**< \brief [20:20] Clear Bit 4 (w) */
    unsigned int PCL5 : 1;                    /**< \brief [21:21] Clear Bit 5 (w) */
    unsigned int PCL6 : 1;                    /**< \brief [22:22] Clear Bit 6 (w) */
    unsigned int PCL7 : 1;                    /**< \brief [23:23] Clear Bit 7 (w) */
    unsigned int reserved_24 : 8;             /**< \brief \internal Reserved */
} Ifx_P_OMCR4_Bits;

/** \\brief  Port Output Modification Clear Register 8 */
typedef struct _Ifx_P_OMCR8_Bits
{
    unsigned int reserved_0 : 24;             /**< \brief \internal Reserved */
    unsigned int PCL8 : 1;                    /**< \brief [24:24] Clear Bit 8 (w) */
    unsigned int PCL9 : 1;                    /**< \brief [25:25] Clear Bit 9 (w) */
    unsigned int PCL10 : 1;                   /**< \brief [26:26] Clear Bit 10 (w) */
    unsigned int PCL11 : 1;                   /**< \brief [27:27] Clear Bit 11 (w) */
    unsigned int reserved_28 : 4;             /**< \brief \internal Reserved */
} Ifx_P_OMCR8_Bits;

/** \\brief  Port Output Modification Clear Register */
typedef struct _Ifx_P_OMCR_Bits
{
    unsigned int reserved_0 : 16;             /**< \brief \internal Reserved */
    unsigned int PCL0 : 1;                    /**< \brief [16:16] Clear Bit 0 (w) */
    unsigned int PCL1 : 1;                    /**< \brief [17:17] Clear Bit 1 (w) */
    unsigned int PCL2 : 1;                    /**< \brief [18:18] Clear Bit 2 (w) */
    unsigned int PCL3 : 1;                    /**< \brief [19:19] Clear Bit 3 (w) */
    unsigned int PCL4 : 1;                    /**< \brief [20:20] Clear Bit 4 (w) */
    unsigned int PCL5 : 1;                    /**< \brief [21:21] Clear Bit 5 (w) */
    unsigned int PCL6 : 1;                    /**< \brief [22:22] Clear Bit 6 (w) */
    unsigned int PCL7 : 1;                    /**< \brief [23:23] Clear Bit 7 (w) */
    unsigned int PCL8 : 1;                    /**< \brief [24:24] Clear Bit 8 (w) */
    unsigned int PCL9 : 1;                    /**< \brief [25:25] Clear Bit 9 (w) */
    unsigned int PCL10 : 1;                   /**< \brief [26:26] Clear Bit 10 (w) */
    unsigned int PCL11 : 1;                   /**< \brief [27:27] Clear Bit 11 (w) */
    unsigned int PCL12 : 1;                   /**< \brief [28:28] Clear Bit 12 (w) */
    unsigned int PCL13 : 1;                   /**< \brief [29:29] Clear Bit 13 (w) */
    unsigned int PCL14 : 1;                   /**< \brief [30:30] Clear Bit 14 (w) */
    unsigned int PCL15 : 1;                   /**< \brief [31:31] Clear Bit 15 (w) */
} Ifx_P_OMCR_Bits;

/** \\brief  Port Output Modification Register */
typedef struct _Ifx_P_OMR_Bits
{
    unsigned int PS0 : 1;                     /**< \brief [0:0]  (w) */
    unsigned int PS1 : 1;                     /**< \brief [1:1]  (w) */
    unsigned int PS2 : 1;                     /**< \brief [2:2]  (w) */
    unsigned int PS3 : 1;                     /**< \brief [3:3]  (w) */
    unsigned int PS4 : 1;                     /**< \brief [4:4]  (w) */
    unsigned int PS5 : 1;                     /**< \brief [5:5]  (w) */
    unsigned int PS6 : 1;                     /**< \brief [6:6]  (w) */
    unsigned int PS7 : 1;                     /**< \brief [7:7]  (w) */
    unsigned int PS8 : 1;                     /**< \brief [8:8]  (w) */
    unsigned int PS9 : 1;                     /**< \brief [9:9]  (w) */
    unsigned int PS10 : 1;                    /**< \brief [10:10]  (w) */
    unsigned int PS11 : 1;                    /**< \brief [11:11]  (w) */
    unsigned int PS12 : 1;                    /**< \brief [12:12]  (w) */
    unsigned int PS13 : 1;                    /**< \brief [13:13]  (w) */
    unsigned int PS14 : 1;                    /**< \brief [14:14]  (w) */
    unsigned int PS15 : 1;                    /**< \brief [15:15]  (w) */
    unsigned int PCL0 : 1;                    /**< \brief [16:16]  (w) */
    unsigned int PCL1 : 1;                    /**< \brief [17:17]  (w) */
    unsigned int PCL2 : 1;                    /**< \brief [18:18]  (w) */
    unsigned int PCL3 : 1;                    /**< \brief [19:19]  (w) */
    unsigned int PCL4 : 1;                    /**< \brief [20:20]  (w) */
    unsigned int PCL5 : 1;                    /**< \brief [21:21]  (w) */
    unsigned int PCL6 : 1;                    /**< \brief [22:22]  (w) */
    unsigned int PCL7 : 1;                    /**< \brief [23:23]  (w) */
    unsigned int PCL8 : 1;                    /**< \brief [24:24]  (w) */
    unsigned int PCL9 : 1;                    /**< \brief [25:25]  (w) */
    unsigned int PCL10 : 1;                   /**< \brief [26:26]  (w) */
    unsigned int PCL11 : 1;                   /**< \brief [27:27]  (w) */
    unsigned int PCL12 : 1;                   /**< \brief [28:28]  (w) */
    unsigned int PCL13 : 1;                   /**< \brief [29:29]  (w) */
    unsigned int PCL14 : 1;                   /**< \brief [30:30]  (w) */
    unsigned int PCL15 : 1;                   /**< \brief [31:31]  (w) */
} Ifx_P_OMR_Bits;

/** \\brief  Port Output Modification Set Register 0 */
typedef struct _Ifx_P_OMSR0_Bits
{
    unsigned int PS0 : 1;                     /**< \brief [0:0] Set Bit 0 (w) */
    unsigned int PS1 : 1;                     /**< \brief [1:1] Set Bit 1 (w) */
    unsigned int PS2 : 1;                     /**< \brief [2:2] Set Bit 2 (w) */
    unsigned int PS3 : 1;                     /**< \brief [3:3] Set Bit 3 (w) */
    unsigned int reserved_4 : 28;             /**< \brief \internal Reserved */
} Ifx_P_OMSR0_Bits;

/** \\brief  Port Output Modification Set Register 12 */
typedef struct _Ifx_P_OMSR12_Bits
{
    unsigned int reserved_0 : 12;             /**< \brief \internal Reserved */
    unsigned int PS12 : 1;                    /**< \brief [12:12] Set Bit 12 (w) */
    unsigned int PS13 : 1;                    /**< \brief [13:13] Set Bit 13 (w) */
    unsigned int PS14 : 1;                    /**< \brief [14:14] Set Bit 14 (w) */
    unsigned int PS15 : 1;                    /**< \brief [15:15] Set Bit 15 (w) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_P_OMSR12_Bits;

/** \\brief  Port Output Modification Set Register 4 */
typedef struct _Ifx_P_OMSR4_Bits
{
    unsigned int reserved_0 : 4;              /**< \brief \internal Reserved */
    unsigned int PS4 : 1;                     /**< \brief [4:4] Set Bit 4 (w) */
    unsigned int PS5 : 1;                     /**< \brief [5:5] Set Bit 5 (w) */
    unsigned int PS6 : 1;                     /**< \brief [6:6] Set Bit 6 (w) */
    unsigned int PS7 : 1;                     /**< \brief [7:7] Set Bit 7 (w) */
    unsigned int reserved_8 : 24;             /**< \brief \internal Reserved */
} Ifx_P_OMSR4_Bits;

/** \\brief  Port Output Modification Set Register 8 */
typedef struct _Ifx_P_OMSR8_Bits
{
    unsigned int reserved_0 : 8;              /**< \brief \internal Reserved */
    unsigned int PS8 : 1;                     /**< \brief [8:8] Set Bit 8 (w) */
    unsigned int PS9 : 1;                     /**< \brief [9:9] Set Bit 9 (w) */
    unsigned int PS10 : 1;                    /**< \brief [10:10] Set Bit 10 (w) */
    unsigned int PS11 : 1;                    /**< \brief [11:11] Set Bit 11 (w) */
    unsigned int reserved_12 : 20;            /**< \brief \internal Reserved */
} Ifx_P_OMSR8_Bits;

