Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_regdef.h
/** \\brief  Port Output Modification Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int    U;
    /** \brief Signed access */
    signed int      I;
    /** \brief Bitfield access */
    Ifx_P_OMSR_Bits B;
} Ifx_P_OMSR;

/** \\brief  Port Output Modification Set Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int     U;
    /** \brief Signed access */
    signed int       I;
    /** \brief Bitfield access */
    Ifx_P_OMSR0_Bits B;
} Ifx_P_OMSR0;

/** \\brief  Port Output Modification Set Register 12 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int      U;
    /** \brief Signed access */
    signed int        I;
    /** \brief Bitfield access */
    Ifx_P_OMSR12_Bits B;
} Ifx_P_OMSR12;

/** \\brief  Port Output Modification Set Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int     U;
    /** \brief Signed access */
    signed int       I;
    /** \brief Bitfield access */
    Ifx_P_OMSR4_Bits B;
} Ifx_P_OMSR4;

/** \\brief  Port Output Modification Set Register 8 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int     U;
    /** \brief Signed access */
    signed int       I;
    /** \brief Bitfield access */
    Ifx_P_OMSR8_Bits B;
} Ifx_P_OMSR8;

/** \\brief  Port Output Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int   U;
    /** \brief Signed access */
    signed int     I;
    /** \brief Bitfield access */
    Ifx_P_OUT_Bits B;
} Ifx_P_OUT;

/** \\brief  Port Pin Controller Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int    U;
    /** \brief Signed access */
    signed int      I;
    /** \brief Bitfield access */
    Ifx_P_PCSR_Bits B;
} Ifx_P_PCSR;

/** \\brief  Port Pin Function Decision Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int     U;
    /** \brief Signed access */
    signed int       I;
    /** \brief Bitfield access */
    Ifx_P_PDISC_Bits B;
} Ifx_P_PDISC;

/** \\brief  Port Pad Driver Mode Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int    U;
    /** \brief Signed access */
    signed int      I;
    /** \brief Bitfield access */
    Ifx_P_PDR0_Bits B;
} Ifx_P_PDR0;

/** \\brief  Port Pad Driver Mode Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int    U;
    /** \brief Signed access */
    signed int      I;
    /** \brief Bitfield access */
    Ifx_P_PDR1_Bits B;
} Ifx_P_PDR1;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  Port object */
typedef volatile struct _Ifx_P
{
    Ifx_P_OUT     OUT;                      /**< \brief 0, Port Output Register */
    Ifx_P_OMR     OMR;                      /**< \brief 4, Port Output Modification Register */
    Ifx_P_ID      ID;                       /**< \brief 8, Port Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_P_IOCR0   IOCR0;                    /**< \brief 10, Port Input/Output Control Register 0 */
    Ifx_P_IOCR4   IOCR4;                    /**< \brief 14, Port Input/Output Control Register 4 */
    Ifx_P_IOCR8   IOCR8;                    /**< \brief 18, Port Input/Output Control Register 8 */
    Ifx_P_IOCR12  IOCR12;                   /**< \brief 1C, Port Input/Output Control Register 12 */
    unsigned char reserved_20[4];           /**< \brief 20, \internal Reserved */
    Ifx_P_IN      IN;                       /**< \brief 24, Port Input Register */
    unsigned char reserved_28[24];          /**< \brief 28, \internal Reserved */
    Ifx_P_PDR0    PDR0;                     /**< \brief 40, Port Pad Driver Mode Register 0 */
    Ifx_P_PDR1    PDR1;                     /**< \brief 44, Port Pad Driver Mode Register 1 */
    unsigned char reserved_48[8];           /**< \brief 48, \internal Reserved */
    Ifx_P_ESR     ESR;                      /**< \brief 50, Port Emergency Stop Register */
    unsigned char reserved_54[12];          /**< \brief 54, \internal Reserved */
    Ifx_P_PDISC   PDISC;                    /**< \brief 60, Port Pin Function Decision Control Register */
    Ifx_P_PCSR    PCSR;                     /**< \brief 64, Port Pin Controller Select Register */
    unsigned char reserved_68[8];           /**< \brief 68, \internal Reserved */
    Ifx_P_OMSR0   OMSR0;                    /**< \brief 70, Port Output Modification Set Register 0 */
    Ifx_P_OMSR4   OMSR4;                    /**< \brief 74, Port Output Modification Set Register 4 */
    Ifx_P_OMSR8   OMSR8;                    /**< \brief 78, Port Output Modification Set Register 8 */
    Ifx_P_OMSR12  OMSR12;                   /**< \brief 7C, Port Output Modification Set Register 12 */
    Ifx_P_OMCR0   OMCR0;                    /**< \brief 80, Port Output Modification Clear Register 0 */
    Ifx_P_OMCR4   OMCR4;                    /**< \brief 84, Port Output Modification Clear Register 4 */
    Ifx_P_OMCR8   OMCR8;                    /**< \brief 88, Port Output Modification Clear Register 8 */
    Ifx_P_OMCR12  OMCR12;                   /**< \brief 8C, Port Output Modification Clear Register 12 */
    Ifx_P_OMSR    OMSR;                     /**< \brief 90, Port Output Modification Set Register */
    Ifx_P_OMCR    OMCR;                     /**< \brief 94, Port Output Modification Clear Register */
    unsigned char reserved_98[8];           /**< \brief 98, \internal Reserved */
    Ifx_P_LPCR0   LPCR0;                    /**< \brief A0, Port LVDS Pad Control Register 0 */
    Ifx_P_LPCR1   LPCR1;                    /**< \brief A4, Port LVDS Pad Control Register 1 */
    Ifx_P_LPCR2   LPCR2;                    /**< \brief A8, Port LVDS Pad Control Register 2 */
    Ifx_P_LPCR3   LPCR3;                    /**< \brief AC, Port LVDS Pad Control Register 3 */
    unsigned char reserved_B0[4];           /**< \brief B0, \internal Reserved */
    Ifx_P_LPCR5   LPCR5;                    /**< \brief B4, Port LVDS Pad Control Register 5 */
    Ifx_P_LPCR6   LPCR6;                    /**< \brief B8, Port LVDS Pad Control Register 6 */
    unsigned char reserved_B8[60];          /**< \brief BC, \internal Reserved */
    Ifx_P_ACCEN1  ACCEN1;                   /**< \brief F8, Port Access Enable Register 1 */
    Ifx_P_ACCEN0  ACCEN0;                   /**< \brief FC, Port Access Enable Register 0 */
} Ifx_P;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPORT_REGDEF_H */
